<?xml version="1.0" ?>
<net name="text-to-speech-en-0001-duration-prediction" version="10">
	<layers>
		<layer id="0" name="pos_mask" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 1, 512, 512"/>
			<output>
				<port id="0" names="pos_mask" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_mask" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 1, 512"/>
			<output>
				<port id="0" names="input_mask" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_seq" type="Parameter" version="opset1">
			<data element_type="i32" shape="1, 512"/>
			<output>
				<port id="0" names="input_seq" precision="I32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model.embedding.weight" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="148, 256" size="75776"/>
			<output>
				<port id="0" names="model.embedding.weight" precision="FP16">
					<dim>148</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_0/axis" type="Const" version="opset1">
			<data element_type="i64" offset="75776" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="5" name="Gather_01188" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>148</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="402" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="925" type="Const" version="opset1">
			<data element_type="i64" offset="75784" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_342" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="841" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="LeakyRelu_343/weights2597339324" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="LeakyRelu_343" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="842" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model.prenet.dilation_stack.blocks.0.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="75812" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.0.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_344/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_344/Dims9583" type="Const" version="opset1">
			<data element_type="f16" offset="206884" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_344" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="843" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="LeakyRelu_345/weights2598938478" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="LeakyRelu_345" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="844" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model.prenet.dilation_stack.blocks.0.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="207396" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.0.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_346/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_346/Dims9469" type="Const" version="opset1">
			<data element_type="f16" offset="338468" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_346" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="845" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model.prenet.dilation_stack.shortcuts.0.weight" type="Const" version="opset1">
			<data element_type="f16" offset="338980" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.0.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_347/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_347/Dims9361" type="Const" version="opset1">
			<data element_type="f16" offset="470052" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_347" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="846" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add_348" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="847" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="LeakyRelu_349/weights2595738844" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="LeakyRelu_349" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="848" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model.prenet.dilation_stack.blocks.1.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="470564" shape="256, 256, 3" size="393216"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.1.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_350/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="1" pads_end="1" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_350/Dims9673" type="Const" version="opset1">
			<data element_type="f16" offset="863780" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_350" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="849" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="LeakyRelu_351/weights2592939141" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="LeakyRelu_351" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="850" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.prenet.dilation_stack.blocks.1.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="864292" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.1.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_352/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_352/Dims9445" type="Const" version="opset1">
			<data element_type="f16" offset="995364" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_352" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="851" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model.prenet.dilation_stack.shortcuts.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="995876" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_353/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_353/Dims9565" type="Const" version="opset1">
			<data element_type="f16" offset="1126948" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_353" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="852" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Add_354" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="853" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="LeakyRelu_355/weights2592538421" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="LeakyRelu_355" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="854" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model.prenet.dilation_stack.blocks.2.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="1127460" shape="256, 256, 5" size="655360"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.2.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_356/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="2" pads_end="2" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_356/Dims9301" type="Const" version="opset1">
			<data element_type="f16" offset="1782820" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_356" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="855" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="LeakyRelu_357/weights2597738772" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="LeakyRelu_357" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="856" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model.prenet.dilation_stack.blocks.2.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="1783332" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.2.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_358/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_358/Dims9403" type="Const" version="opset1">
			<data element_type="f16" offset="1914404" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_358" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="857" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model.prenet.dilation_stack.shortcuts.2.weight" type="Const" version="opset1">
			<data element_type="f16" offset="1914916" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.2.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_359/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_359/Dims9415" type="Const" version="opset1">
			<data element_type="f16" offset="2045988" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_359" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="858" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Add_360" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="859" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="LeakyRelu_361/weights2596938943" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="LeakyRelu_361" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="860" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model.prenet.dilation_stack.blocks.3.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="2046500" shape="256, 256, 7" size="917504"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.3.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_362/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="6" pads_end="6" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_362/Dims9649" type="Const" version="opset1">
			<data element_type="f16" offset="2964004" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_362" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="861" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="LeakyRelu_363/weights2598539369" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="LeakyRelu_363" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="862" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model.prenet.dilation_stack.blocks.3.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="2964516" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.3.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_364/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_364/Dims9571" type="Const" version="opset1">
			<data element_type="f16" offset="3095588" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_364" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="863" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model.prenet.dilation_stack.shortcuts.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="3096100" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_365/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_365/Dims9373" type="Const" version="opset1">
			<data element_type="f16" offset="3227172" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_365" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="864" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add_366" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="865" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="LeakyRelu_367/weights2596538526" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="LeakyRelu_367" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="866" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model.prenet.dilation_stack.blocks.4.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="3227684" shape="256, 256, 9" size="1179648"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.4.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_368/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_368/Dims9559" type="Const" version="opset1">
			<data element_type="f16" offset="4407332" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_368" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="867" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="LeakyRelu_369/weights2598138598" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="LeakyRelu_369" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="868" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model.prenet.dilation_stack.blocks.4.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="4407844" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.4.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_370/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_370/Dims9529" type="Const" version="opset1">
			<data element_type="f16" offset="4538916" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_370" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="869" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model.prenet.dilation_stack.shortcuts.4.weight" type="Const" version="opset1">
			<data element_type="f16" offset="4539428" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.4.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_371/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_371/Dims9343" type="Const" version="opset1">
			<data element_type="f16" offset="4670500" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_371" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="870" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Add_372" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="871" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="LeakyRelu_373/weights2591739738" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="LeakyRelu_373" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="872" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="model.prenet.dilation_stack.blocks.5.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="4671012" shape="256, 256, 11" size="1441792"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.5.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_374/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="10" pads_end="10" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_374/Dims9307" type="Const" version="opset1">
			<data element_type="f16" offset="6112804" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_374" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="873" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="LeakyRelu_375/weights2593338514" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="LeakyRelu_375" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="874" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model.prenet.dilation_stack.blocks.5.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="6113316" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.5.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_376/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_376/Dims9637" type="Const" version="opset1">
			<data element_type="f16" offset="6244388" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_376" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="875" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="model.prenet.dilation_stack.shortcuts.5.weight" type="Const" version="opset1">
			<data element_type="f16" offset="6244900" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.5.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_377/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_377/Dims9283" type="Const" version="opset1">
			<data element_type="f16" offset="6375972" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_377" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="876" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Add_378" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="877" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LeakyRelu_379/weights2595338892" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="LeakyRelu_379" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="878" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model.prenet.dilation_stack.blocks.6.1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="6376484" shape="256, 256, 13" size="1703936"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.6.1.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_380/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="2" pads_begin="12" pads_end="12" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_380/Dims9481" type="Const" version="opset1">
			<data element_type="f16" offset="8080420" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_380" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="879" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="LeakyRelu_381/weights2592138661" type="Const" version="opset1">
			<data element_type="f32" offset="75808" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="LeakyRelu_381" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="880" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="model.prenet.dilation_stack.blocks.6.3.weight" type="Const" version="opset1">
			<data element_type="f16" offset="8080932" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.blocks.6.3.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_382/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_382/Dims9439" type="Const" version="opset1">
			<data element_type="f16" offset="8212004" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_382" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="881" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="model.prenet.dilation_stack.shortcuts.6.weight" type="Const" version="opset1">
			<data element_type="f16" offset="8212516" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="model.prenet.dilation_stack.shortcuts.6.weight" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_383/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_383/Dims9553" type="Const" version="opset1">
			<data element_type="f16" offset="8343588" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_383" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
