<?xml version="1.0" ?>
<net name="text-to-speech-en-0001-generation" version="10">
	<layers>
		<layer id="0" name="mel" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 80, 128"/>
			<output>
				<port id="0" names="mel" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="93326117" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="933" type="Const" version="opset1">
			<data element_type="i64" offset="24" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_18" type="Const" version="opset1">
			<data element_type="f16" offset="48" shape="" size="2"/>
			<output>
				<port id="0" names="161" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="Pad_19" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="162" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_mul_12595" type="Const" version="opset1">
			<data element_type="f16" offset="50" shape="1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Div_23/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_12597" type="Const" version="opset1">
			<data element_type="f16" offset="52" shape="1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Add_21/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="166" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="92725673" type="Const" version="opset1">
			<data element_type="i64" offset="54" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="927" type="Const" version="opset1">
			<data element_type="i64" offset="54" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_23" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="Pad_42" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="189" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Mul_45" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="512, 80, 7" size="573440"/>
			<output>
				<port id="0" names="192" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_46/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_46/Dims7605" type="Const" version="opset1">
			<data element_type="f16" offset="573520" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_46" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="193" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="LeakyRelu_47/weights1978126120" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="LeakyRelu_47" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="194" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Mul_50" type="Const" version="opset1">
			<data element_type="f16" offset="574548" shape="512, 512, 17" size="8912896"/>
			<output>
				<port id="0" names="197" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_51/Dims7437" type="Const" version="opset1">
			<data element_type="f16" offset="9487444" shape="1, 512, 1" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="198" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Unsqueeze_52/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="9488468" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Unsqueeze_52/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="199" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Shape_71" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="218" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_75/Concat814725970" type="Const" version="opset1">
			<data element_type="i64" offset="9488476" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_75/Concat8137814825949" type="Const" version="opset1">
			<data element_type="i64" offset="9488484" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_75/Strides814925625" type="Const" version="opset1">
			<data element_type="i64" offset="9488492" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Slice_75" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="222" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Shape_53" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="200" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_54" type="Const" version="opset1">
			<data element_type="i32" offset="9488500" shape="" size="4"/>
			<output>
				<port id="0" names="201" precision="I32"/>
			</output>
		</layer>
		<layer id="32" name="Gather_55/axis" type="Const" version="opset1">
			<data element_type="i64" offset="9488476" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="33" name="Gather_551013" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="202" precision="I64"/>
			</output>
		</layer>
		<layer id="34" name="Cast_56" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64"/>
			</input>
			<output>
				<port id="1" names="203" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="Constant_57" type="Const" version="opset1">
			<data element_type="f32" offset="9488504" shape="" size="4"/>
			<output>
				<port id="0" names="204" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="Mul_58" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" names="205,206" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="Floor_60" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
			</input>
			<output>
				<port id="1" names="207" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="Unsqueeze_67/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="9488476" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Unsqueeze_67/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="214" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Shape_61" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="208" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_62" type="Const" version="opset1">
			<data element_type="i32" offset="9488508" shape="" size="4"/>
			<output>
				<port id="0" names="209" precision="I32"/>
			</output>
		</layer>
		<layer id="42" name="Gather_63/axis" type="Const" version="opset1">
			<data element_type="i64" offset="9488476" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="43" name="Gather_63983" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="210" precision="I64"/>
			</output>
		</layer>
		<layer id="44" name="Cast_64" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64"/>
			</input>
			<output>
				<port id="1" names="211,212" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="Floor_66" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
			</input>
			<output>
				<port id="1" names="213" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="Unsqueeze_68/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="9488476" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Unsqueeze_68/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="215" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Concat_69" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="216" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Cast_76" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="223" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Concat_77" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="224" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Resize_79/StridedSlice_sizes_input_port_1/value606125841" type="Const" version="opset1">
			<data element_type="i64" offset="9488484" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Resize_79/StridedSlice_sizes_input_port_2/value606326195" type="Const" version="opset1">
			<data element_type="i64" offset="9488512" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Resize_79/StridedSlice_sizes_input_port_3/value606525808" type="Const" version="opset1">
			<data element_type="i64" offset="9488492" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Resize_79/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="6081" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Resize_79/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="6080" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Resize_79/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Resize_79/Add_input_port_1/value607925964" type="Const" version="opset1">
			<data element_type="f32" offset="9488520" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Resize_79/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Resize_79/StridedSlice_scales_input_port_1/value606825967" type="Const" version="opset1">
			<data element_type="i64" offset="9488484" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Resize_79/StridedSlice_scales_input_port_2/value607025844" type="Const" version="opset1">
			<data element_type="i64" offset="9488512" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Resize_79/StridedSlice_scales_input_port_3/value607226165" type="Const" version="opset1">
			<data element_type="i64" offset="9488492" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Resize_79/StridedSlice_scales" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Resize_79/axis607526012" type="Const" version="opset1">
			<data element_type="i64" offset="9488524" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Resize_79" type="Interpolate" version="opset4">
			<data antialias="false" coordinate_transformation_mode="asymmetric" cube_coeff="-0.75" mode="nearest" nearest_mode="floor" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" shape_calculation_mode="sizes"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>138</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="226" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1104</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Squeeze_80/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="9488468" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Squeeze_80" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1104</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="227" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Mul_83" type="Const" version="opset1">
			<data element_type="f16" offset="9488540" shape="256, 512, 33" size="8650752"/>
			<output>
				<port id="0" names="230" precision="FP16">
					<dim>256</dim>
					<dim>512</dim>
					<dim>33</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_84/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="16" pads_end="16" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>512</dim>
					<dim>33</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_84/Dims7389" type="Const" version="opset1">
			<data element_type="f16" offset="18139292" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="231" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Mul_87" type="Const" version="opset1">
			<data element_type="f16" offset="18139804" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="234" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_88/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_88/Dims7407" type="Const" version="opset1">
			<data element_type="f16" offset="18270876" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_88" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="235" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="LeakyRelu_89/weights1973325586" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="LeakyRelu_89" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="236" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="91525667" type="Const" version="opset1">
			<data element_type="i64" offset="18271388" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="915" type="Const" version="opset1">
			<data element_type="i64" offset="18271388" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_176" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="82" name="Pad_108" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="259" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1106</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Mul_111" type="Const" version="opset1">
			<data element_type="f16" offset="18271412" shape="256, 256, 3" size="393216"/>
			<output>
				<port id="0" names="262" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_112/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1106</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_112/Dims7521" type="Const" version="opset1">
			<data element_type="f16" offset="18664628" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_112" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="263" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="LeakyRelu_113/weights1978526099" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LeakyRelu_113" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="264" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Mul_116" type="Const" version="opset1">
			<data element_type="f16" offset="18665140" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="267" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_117/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_117/Dims7503" type="Const" version="opset1">
			<data element_type="f16" offset="18796212" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_117" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="268" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Add_118" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</input>
			<output>
				<port id="2" names="269" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Mul_121" type="Const" version="opset1">
			<data element_type="f16" offset="18796724" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="272" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_122/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_122/Dims7545" type="Const" version="opset1">
			<data element_type="f16" offset="18927796" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_122" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="273" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="LeakyRelu_123/weights1967326207" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="LeakyRelu_123" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="274" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="936" type="Const" version="opset1">
			<data element_type="i64" offset="54" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="93625919" type="Const" version="opset1">
			<data element_type="i64" offset="54" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_217" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="103" name="Pad_142" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="297" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1110</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Mul_145" type="Const" version="opset1">
			<data element_type="f16" offset="18928308" shape="256, 256, 3" size="393216"/>
			<output>
				<port id="0" names="300" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_146/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="3" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1110</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_146/Dims7539" type="Const" version="opset1">
			<data element_type="f16" offset="19321524" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_146" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="301" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="LeakyRelu_147/weights1972525961" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="LeakyRelu_147" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="302" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Mul_150" type="Const" version="opset1">
			<data element_type="f16" offset="19322036" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="305" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_151/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_151/Dims7443" type="Const" version="opset1">
			<data element_type="f16" offset="19453108" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_151" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="306" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Add_152" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</input>
			<output>
				<port id="2" names="307" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Mul_155" type="Const" version="opset1">
			<data element_type="f16" offset="19453620" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="310" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_156/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_156/Dims7449" type="Const" version="opset1">
			<data element_type="f16" offset="19584692" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_156" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="311" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="LeakyRelu_157/weights1970925877" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="LeakyRelu_157" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="312" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="945" type="Const" version="opset1">
			<data element_type="i64" offset="19585204" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="94526027" type="Const" version="opset1">
			<data element_type="i64" offset="19585204" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_258" type="Const" version="opset1">
			<data element_type="f16" offset="78" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="124" name="Pad_176" type="Pad" version="opset1">
			<data pad_mode="reflect"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" names="335" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1122</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Mul_179" type="Const" version="opset1">
			<data element_type="f16" offset="19585228" shape="256, 256, 3" size="393216"/>
			<output>
				<port id="0" names="338" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Conv_180/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="9" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1122</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Conv_180/Dims7479" type="Const" version="opset1">
			<data element_type="f16" offset="19978444" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_180" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="339" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="LeakyRelu_181/weights1971325646" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="LeakyRelu_181" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="340" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Mul_184" type="Const" version="opset1">
			<data element_type="f16" offset="19978956" shape="256, 256, 1" size="131072"/>
			<output>
				<port id="0" names="343" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Conv_185/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="0" pads_end="0" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Conv_185/Dims7533" type="Const" version="opset1">
			<data element_type="f16" offset="20110028" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Conv_185" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="344" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Add_186" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</input>
			<output>
				<port id="2" names="345" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="LeakyRelu_187/weights1972126024" type="Const" version="opset1">
			<data element_type="f32" offset="574544" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="LeakyRelu_187" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="346" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Mul_190" type="Const" version="opset1">
			<data element_type="f16" offset="20110540" shape="256, 256, 17" size="2228224"/>
			<output>
				<port id="0" names="349" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>17</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Conv_191/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1" pads_begin="8" pads_end="8" strides="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>17</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Conv_191/Dims7611" type="Const" version="opset1">
			<data element_type="f16" offset="22338764" shape="1, 256, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Conv_191" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
